package com.example.chemistryquizapp;

public class QuestionCh2 {
    private String mQuestions [] = {
            "शुद्ध तत्व कौन-सा है ?",
            "निम्नलिखित में कौन ऊष्मा और विद्युत का सुचालक है ?",
            "कॉपर चूर्ण को वायु में गर्म करने पर उसके सतह पर कॉपर ऑक्साइड की एक परत जम जाती है । इस परत का रंग कैसा है ?",
            "निम्नलिखित में से कौन न तो तत्व है और न ही यौगिक ?",
            "पेन्सिल बनाने में कार्बन के किस अपरूप का उपयोग किया जाता है ?",
            "स्टेनलेस स्टील क्या है ?",
            "दो या दो से अधिक शुद्ध पदार्थों को किसी भी अनुपात में मिला देने से बनता क्या बनता है ?",
            "क्लोरोफॉर्म का क्वथनांक है ?",
            "जस्ता के अयस्क है ?",
            "निम्न में कौन कार्बन के अपरूप है ?",
            "पदार्थ का चतुर्थ अवस्था क्या है ?",
            "लोहे पर भाप की अभिक्रिया से कौन-सा गैस उत्पन होता है ?",
            "शाक- सब्जियों का विघटित होकर कम्पोस्ट बनना किस अभिक्रिया का उदाहरण है ?",
            "कॉपर को वायु में जलाने पर कौन सा यौगिक बनता है ?",
            "निम्नलिखित में से कौन एक यौगिक है ?",
            ""

    };


    private String mChoices [][] = {
            {"काँच", "सीमेंट", "सोडियम"},
            {"हीरा", "चारकोल", "ग्रेफाइट"},
            {"काली", "श्वेत", "पीला"},
            {"पारा", "जल", "वायु"},
            {"कोक", "आइसोप्रीन", "ग्रेफाइट"},
            {"यौगिक", "तत्व", "मिश्रण"},
            {"द्रव", "ठोस", "मिश्रण"},
            {"391K", "334K", "351K"},
            {"जिंक ब्लेड", "बॉक्साइट", "सोडियम क्लोराइड"},
            {"हीरा", "फुलेरिन", "सभी"},
            {"प्लाज्मा", "तरल", "गैस"},
            {"हाइड्रोजन गैस", "ऑक्सीजन गैस", "अमोनिया गैस"},
            {"उष्माक्षोषी", "उष्माक्षेपी", "प्रतिस्थापन"},
            {"कॉपर हाइड्रॉक्साइड", "कॉपर हाइड्राइड", "कॉपर ऑक्साइड"},
            {"पीतल", "स्टील", "रेत"},
            {"", "", ""}
    };



    private String mCorrectAnswers[] = {
            "सोडियम",
            "ग्रेफाइट",
            "काली",
            "वायु",
            "ग्रेफाइट",
            "मिश्रण",
            "मिश्रण",
            "334K",
            "जिंक ब्लेड",
            "सभी",
            "प्लाज्मा",
            "हाइड्रोजन गैस",
            "उष्माक्षेपी",
            "कॉपर ऑक्साइड",
            "रेत",
            ""

    };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public int getLength(){
        return mQuestions.length;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }
}
