package com.example.chemistryquizapp;

public class QuestionsCh1 {
    private String mQuestions [] = {
            "शुष्क बुझा हुआ चूना पर क्लोरीन गैस की क्रिया से कौन -सा पदार्थ बनता है ?",
            "न्यूट्रॉन और प्रोटॉन के संख्याओं के योगफल को क्या कहते हैं ?",
            "नमक के घोल में सिलवर नाइट्रेट का घोल डालने पर दही जैसे पदार्थ उत्पन्न होता है । यह कौन सी अभिक्रिया है ?",
            "दो या दो से अधिक तत्वों के मात्रा के विचार से एक निश्चित अनुपात में संयोग करने से बना पदार्थ कहलाता है ?",
            "निम्नलिखित में से किस परमाणु के नाभिक में न्यूट्रॉन नहीं होता है ?",
            "नाभिक के धनावेशित होने की खोज की थी ?",
            "निम्न में कौन विजातीय यौगिक है ?",
            "प्रोटॉन की खोज किसने की थी ?",
            "ऐसे तत्व जिनमें धातु और अधातु दोनों के गुण पाये जाते हैं, कहलाते हैं ?",
            "किसी परमाणु के गुण निर्भर करते हैं ?",
            "विरंजक चूर्ण क्या है ?",
            "निम्न में कौन ऑक्सीकरण नहीं है ?",
            "वायु क्या है ?",
            "तत्व के सबसे छोटे भाग को क्या कहा जाता है ?",
            "निम्नलिखित में से किस अधातु में धातुई चमक पायी जाती है ?",
            "निम्नलिखित में से कौन धातु होते हुए भी विद्युत का कुचालक है ?",
            "परमाणु विद्युततः क्या होते है ?",
            "निम्न में कौन अधातु विद्युत का सुचालक है ?",
            "एक ही प्रकार के परमाणुओं से मिलकर बना पदार्थ क्या कहलाता है ?",
            "निम्नलिखित में से किस पदार्थ में ऑक्सीजन नहीं है ?",
            ""

    };


    private String mChoices [][] = {
            {"कैल्सियम क्लोराइड", "विरंजक चूर्ण", "हाइड्रोक्लोरिक अम्ल"},
            {"क्वान्टम संख्या", "द्रव्यमान संख्या", "परमाणु संख्या"},
            {"विस्थापन", "उदासीनीकरण", "संयोजन"},
            {"यौगिक", "मिश्रण", "द्रव"},
            {"हीलियम", "ट्राइटियम", "हाइड्रोजन"},
            {"जॉन डाल्टन", "रदरफोर्ड", "अरस्तू"},
            {"प्लास्टर ऑफ पेरिस", "खड़िया", "संगमरमर"},
            {"मैडम क्यूरी", "फैराडे", "रदरफोर्ड"},
            {"उपधातु", "धातुमल", "मिश्रधातु"},
            {"इलेक्ट्रॉनिक संरचना पर", "न्यूट्रॉन की संख्या पर", "परमाणु भार पर"},
            {"तत्व", "यौगिक", "मिश्रण"},
            {"दहन", "अवक्षेपण", "भोजन का पचना"},
            {"यौगिक", "मिश्रण", "द्रव"},
            {"परमाणु", "ऋणायन", "धनायन"},
            {"आयोडीन", "ग्रेफाइट", "दोनों"},
            {"लेड", "तीन", "कॉपर"},
            {"ऋणात्मक", "धनात्मक", "उदासीन"},
            {"ग्रेफाइट", "कॉपर", "सल्फर"},
            {"यौगिक", "मिश्रण", "तत्व"},
            {"मिट्टी का तेल", "काँच", "रेत"},
            {"", "", ""}
    };



    private String mCorrectAnswers[] = {
            "विरंजक चूर्ण",
            "द्रव्यमान संख्या",
            "उदासीनीकरण",
            "यौगिक",
            "हाइड्रोजन",
            "रदरफोर्ड",
            "प्लास्टर ऑफ पेरिस",
            "रदरफोर्ड",
            "उपधातु",
            "इलेक्ट्रॉनिक संरचना पर",
            "यौगिक",
            "अवक्षेपण",
            "मिश्रण",
            "परमाणु",
            "दोनों",
            "लेड",
            "उदासीन",
            "कॉपर",
            "तत्व",
            "मिट्टी का तेल",
            ""
    };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public int getLength(){
        return mQuestions.length;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}
